Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../playbooks/inventory.yml"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.master01 must be replaced
-/+ resource "yandex_compute_instance" "master01" {
      ~ created_at                = "2024-01-31T19:31:00Z" -> (known after apply)
      ~ folder_id                 = "b1gse6fjmhipl4je57pj" -> (known after apply)
      ~ fqdn                      = "master01.netology.yc" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ id                        = "epduod0empivamlpmhss" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "master01"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epdbk7qehitc2c26n423" -> (known after apply)
          ~ disk_id     = "epdbk7qehitc2c26n423" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
                name        = "root-master01"
              ~ size        = 40 -> 44 # forces replacement
              + snapshot_id = (known after apply)
              ~ type        = "network-ssd" -> "network-nvme" # forces replacement
                # (1 unchanged attribute hidden)
            }
        }

      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:1e:c3:40:eb" -> (known after apply)
          ~ nat_ip_address     = "51.250.109.204" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - scheduling_policy {
          - preemptible = false -> null
        }

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.worker01 must be replaced
-/+ resource "yandex_compute_instance" "worker01" {
      ~ created_at                = "2024-01-31T19:30:56Z" -> (known after apply)
      ~ folder_id                 = "b1gse6fjmhipl4je57pj" -> (known after apply)
      ~ fqdn                      = "worker01.netology.yc" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ id                        = "epdn9k50dlbstd0i6s7r" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "worker01"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epde06amkjb7jc8jj1uu" -> (known after apply)
          ~ disk_id     = "epde06amkjb7jc8jj1uu" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
                name        = "root-worker01"
              + snapshot_id = (known after apply)
              ~ type        = "network-ssd" -> "network-nvme" # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:17:4d:0a:06" -> (known after apply)
          ~ nat_ip_address     = "51.250.27.227" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

  # yandex_compute_instance.worker02 must be replaced
-/+ resource "yandex_compute_instance" "worker02" {
      ~ created_at                = "2024-01-31T19:30:56Z" -> (known after apply)
      ~ folder_id                 = "b1gse6fjmhipl4je57pj" -> (known after apply)
      ~ fqdn                      = "worker02.netology.yc" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ id                        = "epdvh6lj1h4s23anafcr" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "worker02"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epdi64mmdib5pseqd6ur" -> (known after apply)
          ~ disk_id     = "epdi64mmdib5pseqd6ur" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
                name        = "root-worker02"
              + snapshot_id = (known after apply)
              ~ type        = "network-ssd" -> "network-nvme" # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:1f:89:ab:30" -> (known after apply)
          ~ nat_ip_address     = "51.250.105.185" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.

Changes to Outputs:
~ external_ip_address_node00 = "51.250.109.204" -> (known after apply)
~ external_ip_address_node01 = "51.250.27.227" -> (known after apply)
~ external_ip_address_node02 = "51.250.105.185" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://171f61c8c11b:4141/lock?id=Scandr%252Fnetology_devops_diploma%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 4 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`